of60/tutorials/rheoFoam/OtherTests/Channel2D_VE/otherModels/VCM/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(tau)        Gauss linear;
    div(phi,U)      GaussDefCmpw none;
    div(phi,nA)     GaussDefCmpw cubista;
    div(phi,nB)     GaussDefCmpw cubista;
    div(phi,A)      GaussDefCmpw cubista;
    div(phi,B)      GaussDefCmpw cubista;
    divLinear       Gauss linear;
}

laplacianSchemes
{
    default                       Gauss linear corrected;
        
}

interpolationSchemes
{
    default           linear;
      
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p;
    pcorr;
}

// ************************************************************************* //
